## pandas - Avanzado

- Filtros en DataFrames.
- Cambiar tipos de datos.
- Concatenación de DataFrames.
- Merge (join).
- Métodos _**.map()**_, _**.applymap()**_ y _**.apply()**_.
- Manipulación de NaN's en _**pandas**_.
- _**GroupBy**_.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Versiones

print(f"numpy=={np.__version__}")
print(f"pandas=={pd.__version__}")

numpy==2.2.1
pandas==2.2.3

In [74]:
# Usaremos 2 DataFrames

df1 = pd.read_csv("../Data/titanic_1.csv")
df2 = pd.read_csv("../Data/titanic_2.csv")

In [75]:
df1.head(3)

,PassengerId,Name,Sex,Age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0

In [77]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 28.0+ KB

In [5]:
df2.head(3)

   PassengerId  Survived  Pclass            Ticket     Fare
0            1         0       3         A/5 21171   7.2500
1            2         1       1          PC 17599  71.2833
2            3         1       3  STON/O2. 3101282   7.9250

### Filtros en DataFrames

Para aplicar filtros o "máscaras" en los _**pd.DataFrames()**_ utilizaremos una sintaxis muy similar a _**np.where()**_.

La sintaxis se basa en condicionales y para unir 2 o más condiciones usaremos _**&**_, _**|**_ y _**~**_, en lugar de _**and**_, _**or**_ y _**not**_ respectivamente.

Si tenemos más de una condición, cada condición se debe agrupar usando paréntesis.

| Operador     | Operación     |
|--------------|---------------|
| **==**       | Igual         |
| **!=**       | Diferente     |
| **>**        | Mayor que     |
| **<**        | Menor que     |
| **>=**       | Mayor o igual |
| **<=**       | Menor o igual |

In [6]:
# Para aplicar un filtro usamos los operadores de comparación

# Usamos df1

df1["Age"] > 18

# Esto retorna una pd.Series() con True y False

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [78]:
# Si quisieramos aplicar ese "filtro" al DataFrame hariamos un "indexing" con el operador

df1[df1["Age"] > 18]

# Esto nos retorna el DataFrame solo con las filas que cumplen la condición
# En este ejemplo filtramos el DataFrame para quedarnos con las filas donde "Age" es mayor estricto a 18

,PassengerId,Name,Sex,Age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,"Allen, Mr. William Henry",male,35.0
...,...,...,...,...
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0
886,887,"Montvila, Rev. Juozas",male,27.0
887,888,"Graham, Miss. Margaret Edith",female,19.0
889,890,"Behr, Mr. Karl Howell",male,26.0
890,891,"Dooley, Mr. Patrick",male,32.0

In [8]:
# Podemos unir 2 o más condiciones usando | o &
# Cada condición debe de estar entre paréntesis

# En este ejemplo usamos |

df1[(df1["Age"] > 18) | (df1["Sex"] == "female")]

,PassengerId,Name,Sex,Age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,"Allen, Mr. William Henry",male,35.0
...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0
887,888,"Graham, Miss. Margaret Edith",female,19.0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN
889,890,"Behr, Mr. Karl Howell",male,26.0
890,891,"Dooley, Mr. Patrick",male,32.0

In [9]:
# Ejemplo usando &

df1[(df1["Age"] > 18) & (df1["Sex"] == "female")]

,PassengerId,Name,Sex,Age
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
11,12,"Bonnell, Miss. Elizabeth",female,58.0
...,...,...,...,...
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0
887,888,"Graham, Miss. Margaret Edith",female,19.0

In [10]:
df2.head(3)

   PassengerId  Survived  Pclass            Ticket     Fare
0            1         0       3         A/5 21171   7.2500
1            2         1       1          PC 17599  71.2833
2            3         1       3  STON/O2. 3101282   7.9250

In [11]:
# Usamos df2

df2[(df2["Pclass"] == 1) | (df2["Pclass"] == 2)]

     PassengerId  Survived  Pclass            Ticket     Fare
1              2         1       1          PC 17599  71.2833
3              4         1       1            113803  53.1000
6              7         0       1             17463  51.8625
9             10         1       2            237736  30.0708
11            12         1       1            113783  26.5500
..           ...       ...     ...               ...      ...
880          881         1       2            230433  26.0000
883          884         0       2  C.A./SOTON 34068  10.5000
886          887         0       2            211536  13.0000
887          888         1       1            112053  30.0000
889          890         1       1            111369  30.0000

[400 rows x 5 columns]

In [12]:
# Es posible hacer un filtro que no tenga ningun resultado
# Esto nos retorna un DataFrame vacío

df2[(df2["Pclass"] == 1) & (df2["Pclass"] == 2)]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Ticket, Fare]
Index: []

Ahora veremos métodos que nos ayudarán a filtrar de forma más eficiente en ciertos casos

|Método           |Descripción                                                                                                                  |
|-----------------|-----------------------------------------------------------------------------------------------------------------------------|
|**.isin()**      |Filtra el DataFrame usando los valores de una lista. Es similar a concatenar varios _**\|**_.                                |
|**.between()**   |Filtra el DataFrame usando un intervalo. Es similar a esta expresión _**a <= x <= b**_. Solo funciona con columnas numéricas.|
|**.duplicated()**|Muestra los valores duplicados de una columna, omite la primera fila donde aparece ese valor.                                |

In [13]:
# Filtramos sobre la misma columna

df2[(df2["Pclass"] == 1) | (df2["Pclass"] == 2)]

     PassengerId  Survived  Pclass            Ticket     Fare
1              2         1       1          PC 17599  71.2833
3              4         1       1            113803  53.1000
6              7         0       1             17463  51.8625
9             10         1       2            237736  30.0708
11            12         1       1            113783  26.5500
..           ...       ...     ...               ...      ...
880          881         1       2            230433  26.0000
883          884         0       2  C.A./SOTON 34068  10.5000
886          887         0       2            211536  13.0000
887          888         1       1            112053  30.0000
889          890         1       1            111369  30.0000

[400 rows x 5 columns]

In [14]:
# El mismo resultado se puede lograr con: .isin()

df2[df2["Pclass"].isin([1, 2])]

     PassengerId  Survived  Pclass            Ticket     Fare
1              2         1       1          PC 17599  71.2833
3              4         1       1            113803  53.1000
6              7         0       1             17463  51.8625
9             10         1       2            237736  30.0708
11            12         1       1            113783  26.5500
..           ...       ...     ...               ...      ...
880          881         1       2            230433  26.0000
883          884         0       2  C.A./SOTON 34068  10.5000
886          887         0       2            211536  13.0000
887          888         1       1            112053  30.0000
889          890         1       1            111369  30.0000

[400 rows x 5 columns]

In [15]:
# Se puede usar con números o cadenas

df1[df1["Sex"].isin(["male", "female"])]

,PassengerId,Name,Sex,Age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,"Allen, Mr. William Henry",male,35.0
...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0
887,888,"Graham, Miss. Margaret Edith",female,19.0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN
889,890,"Behr, Mr. Karl Howell",male,26.0
890,891,"Dooley, Mr. Patrick",male,32.0

In [16]:
# Si quisieramos filtrar por un rango, podemos usar: .between()
# Los dos extremos son incluidos
# Solo se puede usar en columnas númericas

df1[(df1["Age"].between(28, 30))]

,PassengerId,Name,Sex,Age
23,24,"Sloper, Mr. William Thompson",male,28.0
34,35,"Meyer, Mr. Edgar Joseph",male,28.0
53,54,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.0
57,58,"Novel, Mr. Mansouer",male,28.5
66,67,"Nye, Mrs. (Elizabeth Ramell)",female,29.0
...,...,...,...,...
799,800,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0
842,843,"Serepeca, Miss. Augusta",female,30.0
848,849,"Harper, Rev. John",male,28.0
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0
883,884,"Banfield, Mr. Frederick James",male,28.0

In [17]:
# Con ~ podemos obtener el resultado opuesto:

df1[~(df1["Age"].between(28, 29))]

# En este ejemplo filtramos todos los elementos donde "Age" es diferente de 28 y 29, también incluye NaN's

,PassengerId,Name,Sex,Age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,"Allen, Mr. William Henry",male,35.0
...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0
887,888,"Graham, Miss. Margaret Edith",female,19.0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN
889,890,"Behr, Mr. Karl Howell",male,26.0
890,891,"Dooley, Mr. Patrick",male,32.0

In [18]:
# Con .duplicated() vemos las filas que tengan valores repetidos, no muestra las primera apariciones

df1[df1["Age"].duplicated()]

     PassengerId                                      Name     Sex   Age
4              5                  Allen, Mr. William Henry    male  35.0
14            15      Vestrom, Miss. Hulda Amanda Adolfina  female  14.0
16            17                      Rice, Master. Eugene    male   2.0
17            18              Williams, Mr. Charles Eugene    male   NaN
19            20                   Masselmani, Mrs. Fatima  female   NaN
..           ...                                       ...     ...   ...
886          887                     Montvila, Rev. Juozas    male  27.0
887          888              Graham, Miss. Margaret Edith  female  19.0
888          889  Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889          890                     Behr, Mr. Karl Howell    male  26.0
890          891                       Dooley, Mr. Patrick    male  32.0

[802 rows x 4 columns]

### Cambiar el tipo de datos

Por lo general **pandas** utilizará los tipos de datos más generales para crear los **pd.DataFrame()**.

Podemos cambiar los tipos de datos de las columnas para ahorrar espacio en memoria o si queremos que los elementos de una columna tengan un comportamiento diferente, como por ejemplo una columna de **enteros** a **strings**.

Para esto usamos el método _**.astype()**_

In [19]:
# Aquí podemos observar el tipo de dato de cada columna como el especio que ocupa en "memory usage"

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 28.0+ KB

In [20]:
# Modificamos el tipo de dato de la columna "PassengerId" a "int8"

df1["PassengerId"] = df1["PassengerId"].astype("int8")

df1.info()

# Ahora "memory usage" es más bajo

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int8
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
dtypes: float64(1), int8(1), object(2)
memory usage: 21.9+ KB

In [21]:
# Cambiamos el tipo de dato de la columna "Sex" a "category"

df1["Sex"] = df1["Sex"].astype("category")

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int8
 1   Name         891 non-null    object
 2   Sex          891 non-null    category
 3   Age          714 non-null    float64
dtypes: category(1), float64(1), int8(1), object(1)
memory usage: 15.9+ KB

In [22]:
# Ahora la columna "Sex" es tipo "category"

df1["Sex"]

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: category
Categories (2, object): ['female', 'male']

In [23]:
# También podemos transformar una columna numérica a string o "object"

df1["PassengerId"] = df1["PassengerId"].astype("str")

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    object
 1   Name         891 non-null    object
 2   Sex          891 non-null    category
 3   Age          714 non-null    float64
dtypes: category(1), float64(1), object(2)
memory usage: 22.0+ KB

In [24]:
# Cambiar 2 o más a la vez

df2[["PassengerId", "Survived", "Pclass"]] = df2[["PassengerId", "Survived", "Pclass"]].astype("int8")

df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int8
 1   Survived     891 non-null    int8
 2   Pclass       891 non-null    int8
 3   Ticket       891 non-null    object
 4   Fare         891 non-null    float64
dtypes: float64(1), int8(3), object(1)
memory usage: 16.7+ KB

### Concatenación de DataFrames

Al igual que **NumPy** podemos concatenar elementos de 2 dimensiones.

Para concatenar usaremos la función _**pd.concat()**_, por defecto esta función usa _**axis = 0**_.

Al concatenar **pandas** verificará si comparten el mismo nombre en las columnas y en las filas.

En **pandas** no es necesario verificar el número de filas/columnas. Si algún _**pd.DataFrame()**_ no concuerda con otro entonces se llenarán los espacios vacíos con _**NaN's**_

#### Horizontal (axis = 1)

In [25]:
df1 = pd.DataFrame({"Columna_1" : ["A", "B"],
                    "Columna_2" : ["C", "D"]})

df2 = pd.DataFrame({"Columna_2" : ["E", "F", "G"],
                    "Columna_4" : ["G", "H", "I"]})

In [26]:
df1

  Columna_1 Columna_2
0         A         C
1         B         D

In [27]:
df2

  Columna_2 Columna_4
0         E         G
1         F         H
2         G         I

In [28]:
# Para concatenar horizontalmente hay que usar axis = 1

# pd.concat() recibe una lista de DataFrames

pd.concat([df1, df2], axis = 1)

  Columna_1 Columna_2 Columna_2 Columna_4
0         A         C         E         G
1         B         D         F         H
2       NaN       NaN         G         I

In [29]:
# Usando un solo pd.concat() podemos concatenar varios DataFrames a la vez, incluso repetirlos

pd.concat([df1, df2, df2, df2], axis = 1)

,Columna_1,Columna_2,Columna_2,Columna_4,Columna_2,Columna_4,Columna_2,Columna_4
0,A,C,E,G,E,G,E,G
1,B,D,F,H,F,H,F,H
2,NaN,NaN,G,I,G,I,G,I

### Vertical

In [30]:
df1 = pd.DataFrame({"Columna_1" : ["A", "B", "1"],
                    "Columna_2" : ["C", "D", "2"]})

df2 = pd.DataFrame({"Columna_1" : ["E", "F"],
                    "Columna_2" : ["G", "H"]})

# Ambos tienen el mismo nombre en las columnas

In [31]:
df1

  Columna_1 Columna_2
0         A         C
1         B         D
2         1         2

In [32]:
df2

  Columna_1 Columna_2
0         E         G
1         F         H

In [33]:
# Como tienen el mismo nombre de columnas, pandas los agrupa automaticamente

pd.concat([df1, df2], axis = 0)

  Columna_1 Columna_2
0         A         C
1         B         D
2         1         2
0         E         G
1         F         H

In [34]:
# Este DataFrame solo tiene un nombre de columna en común

df3 = pd.DataFrame({"Columna_1" : ["E", "F"],
                    "Columna_3" : ["G", "H"]})

df3

  Columna_1 Columna_3
0         E         G
1         F         H

In [35]:
# En este ejemplo los DataFrames tienen columnas diferentes

pd.concat([df1, df3], axis = 0)

# Por eso, pandas agrupa la columna en comun, y las que sean diferentes las llena con NaN's

  Columna_1 Columna_2 Columna_3
0         A         C       NaN
1         B         D       NaN
2         1         2       NaN
0         E       NaN         G
1         F       NaN         H

In [36]:
# Si nos fijamos, pandas incluso concatena los indices, para evitar este comportamiento podemos agregar otro parametro:
# ignore_index = True

pd.concat([df1, df3], axis = 0, ignore_index = True)

  Columna_1 Columna_2 Columna_3
0         A         C       NaN
1         B         D       NaN
2         1         2       NaN
3         E       NaN         G
4         F       NaN         H

### Merge (join)

La operación _**merge**_ (o _join_ en SQL) hace referencia a unir dos **DataFrames** basándose en un conjunto común de columnas, puede ser 1 o más columnas a la vez.

En **pandas** tenemos la función _**pd.merge()**_.

Para hacer "merge" de dos DataFrames es necesario que ambos compartan la misma columna, con el mismo tipo de dato.

Parámetro _**how**_:

- _inner_: Unión "interna", conservando solo las filas que tienen elementos comunes en **ambos DataFrames**.

- _left_: Unión "izquierda", conservando todas las filas del **DataFrame izquierdo**, incluso si no hay coincidencia en el **DataFrame derecho**, las filas sin coincidencia en el **DataFrame derecho** se rellenan con NaN's.

- _right_: Unión "derecha", conservando todas las filas del **DataFrame derecho**, incluso si no hay coincidencia en el **DataFrame izquierdo**, las filas sin coincidencia en el **DataFrame izquierdo** se rellenan con NaN's.

- _outer_: Unión "externa", conservando todas las filas de **ambos DataFrames**. Las filas sin coincidencia en uno de los DataFrames se rellenan con NaN's.

In [37]:
# Usaremos los DataFrames del titanic como ejemplo

# Ambos DataFrames comparten la misma columna "PassengerId"

df1 = pd.read_csv("../Data/titanic_1.csv")
df2 = pd.read_csv("../Data/titanic_2.csv")

In [38]:
df1.head(3)

,PassengerId,Name,Sex,Age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0

In [39]:
df2.head(3)

   PassengerId  Survived  Pclass            Ticket     Fare
0            1         0       3         A/5 21171   7.2500
1            2         1       1          PC 17599  71.2833
2            3         1       3  STON/O2. 3101282   7.9250

In [40]:
# pd.merge() Une dos DataFrames que tengan una columna en común:
# Por defecto "how" es "inner"

df = pd.merge(left = df1, right = df2, left_on = "PassengerId", right_on = "PassengerId", how = "inner")

# Guardamos el resultado en df.

In [41]:
# Ahora vamos a eliminar algunas filas para ver como funcionan los otros valores del parámetro "how"

df1 = df1.drop([1, 3, 5], axis = 0)
df2 = df2.drop([2, 4, 6], axis = 0)

In [42]:
# how = left
# Aquí se mantienen los elementos del DataFrame de la izquierda (df1)
# Los espacios vacíos se llenan con NaN's

pd.merge(left = df1, right = df2, left_on = "PassengerId", right_on = "PassengerId", how = "left")

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0.0,3.0,A/5 21171,7.250
1,3,"Heikkinen, Miss. Laina",female,26.0,NaN,NaN,NaN,NaN
2,5,"Allen, Mr. William Henry",male,35.0,NaN,NaN,NaN,NaN
3,7,"McCarthy, Mr. Timothy J",male,54.0,NaN,NaN,NaN,NaN
4,8,"Palsson, Master. Gosta Leonard",male,2.0,0.0,3.0,349909,21.075
...,...,...,...,...,...,...,...,...
883,887,"Montvila, Rev. Juozas",male,27.0,0.0,2.0,211536,13.000
884,888,"Graham, Miss. Margaret Edith",female,19.0,1.0,1.0,112053,30.000
885,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0.0,3.0,W./C. 6607,23.450
886,890,"Behr, Mr. Karl Howell",male,26.0,1.0,1.0,111369,30.000
887,891,"Dooley, Mr. Patrick",male,32.0,0.0,3.0,370376,7.750

In [43]:
# how = right
# Aquí se mantienen los elementos del DataFrame de la right (df2)
# Los espacios vacíos se llenan con NaN's

pd.merge(left = df1, right = df2, left_on = "PassengerId", right_on = "PassengerId", how = "right")

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,NaN,NaN,NaN,1,1,PC 17599,71.2833
2,4,NaN,NaN,NaN,1,1,113803,53.1000
3,6,NaN,NaN,NaN,0,3,330877,8.4583
4,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750
...,...,...,...,...,...,...,...,...
883,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000
884,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
885,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,W./C. 6607,23.4500
886,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000
887,891,"Dooley, Mr. Patrick",male,32.0,0,3,370376,7.7500

In [44]:
# how = outer
# Aquí se mantienen los elementos de ambos DataFrames
# Los espacios vacíos se llenan con NaN's

pd.merge(left = df1, right = df2, left_on = "PassengerId", right_on = "PassengerId", how = "outer")

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0.0,3.0,A/5 21171,7.2500
1,2,NaN,NaN,NaN,1.0,1.0,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,NaN,NaN,NaN,NaN
3,4,NaN,NaN,NaN,1.0,1.0,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0.0,2.0,211536,13.0000
887,888,"Graham, Miss. Margaret Edith",female,19.0,1.0,1.0,112053,30.0000
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0.0,3.0,W./C. 6607,23.4500
889,890,"Behr, Mr. Karl Howell",male,26.0,1.0,1.0,111369,30.0000
890,891,"Dooley, Mr. Patrick",male,32.0,0.0,3.0,370376,7.7500

In [45]:
# Si ambos DataFrames comparten el mismo nombre de columna podemos usar el parámetro "on"
# En lugar de usar "left_on" y "right_on"

pd.merge(left = df1, right = df2, on = "PassengerId", how = "inner")

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750
2,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
3,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
4,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
...,...,...,...,...,...,...,...,...
880,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000
881,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
882,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,W./C. 6607,23.4500
883,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000
884,891,"Dooley, Mr. Patrick",male,32.0,0,3,370376,7.7500

### .map() y .apply()

Los siguientes métodos se utilizan para transformar una o varias columnas usando una función o un diccionario, también es conocido como "mapeo":

|Método         |Descripción                                                                          |
|---------------|-------------------------------------------------------------------------------------|
|**.map()**     |Aplica una función a cada elemento de una o varias columnas de un **pd.DataFrame()**.|
|**.apply()**   |Aplica una función a cada fila o columna de un **pd.DataFrame()**.                   |

Estos métodos no son **in-place**.

Al usar alguno de estos métodos es importante tomar en cuenta si existen NaN's en la columna/fila/DataFrame, ya que algunas operaciones no son compatibles con los NaN's.

#### .map()

In [46]:
# pd.Series().map()

# En este ejemplo usamos la función anónima (lambda) para transformar una pd.Series()

df["Name"].map(lambda x : x.lower())

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [47]:
# Podemos hacer lo mismo si definimos una función

def transformar_lower(x):
    return x.lower()

df["Name"].map(transformar_lower)

# En este caso no es necesario usar la lambda, pero de igual forma se puede hacer

# df["Name"].map(lambda x : transformar_lower(x))

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [48]:
# Si tenemos un diccionario podemos usarlo para transformar toda la columna

dict_sex = {"male" : "H", "female" : "F"}

df["Sex"].map(dict_sex)

# En este caso no es necesario usar la lambda, pero de igual forma se puede hacer

# df["Name"].map(lambda x : dict_sex[x])

0      H
1      F
2      F
3      F
4      H
      ..
886    H
887    F
888    F
889    H
890    H
Name: Sex, Length: 891, dtype: object

In [49]:
# Podemos usar operadores ternarios

df["Age"].map(lambda x : "mayor" if x >= 18 else "menor")

0      mayor
1      mayor
2      mayor
3      mayor
4      mayor
       ...
886    mayor
887    mayor
888    menor
889    mayor
890    mayor
Name: Age, Length: 891, dtype: object

#### .apply()

In [50]:
# .apply() Se puede utilizar para Series y DataFrames

# Ejemplo en pd.Series()

df["Age"].apply(lambda x : np.sqrt(x))

# np.sqrt() toma en cuenta los NaN's, por eso vemos un elemento NaN en la Serie
# No todas las funciones se comportan de esta forma

# Probar con:
# df["Age"].apply(lambda x : int(x))

0      4.690416
1      6.164414
2      5.099020
3      5.916080
4      5.916080
         ...
886    5.196152
887    4.358899
888         NaN
889    5.099020
890    5.656854
Name: Age, Length: 891, dtype: float64

In [51]:
# Ejemplo en columnas de pd.DataFrame()

df[["PassengerId", "Age"]].apply(lambda x : np.sqrt(x))

     PassengerId       Age
0       1.000000  4.690416
1       1.414214  6.164414
2       1.732051  5.099020
3       2.000000  5.916080
4       2.236068  5.916080
..           ...       ...
886    29.782545  5.196152
887    29.799329  4.358899
888    29.816103       NaN
889    29.832868  5.099020
890    29.849623  5.656854

[891 rows x 2 columns]

In [52]:
# Ejemplo en filas de pd.DataFrame()

df[["PassengerId", "Age"]].apply(lambda x : x["PassengerId"] + x["Age"], axis = 1)

# Este ejemplo es un poco más complejo
# Suma horizontalmente los elementos de cada fila
# En lugar de retornar 2 columnas como el ejemplo anterior solo retorna una.
# Para hacer uso de los elementos en cada columna usamos la variable "x" como si fuese un diccionario
# Indicando que debe hacer con cada elemento de cada columna
# Usamos axis = 1

0       23.0
1       40.0
2       29.0
3       39.0
4       40.0
       ...
886    914.0
887    907.0
888      NaN
889    916.0
890    923.0
Length: 891, dtype: float64

### Manipulación de NaN's en pandas.

- Encontrar NaN's.
- Eliminar NaN's.
- Rellenar NaN's.

#### Encontrar NaN's

In [53]:
# Normalmente en casi todas las operaciones que hace pandas se omiten los valores nulos (NaN's)
# Si quisieramos ver cuantos hay podemos hacer:

df["Age"].value_counts()

# Aquí pandas está omitiendo los NaN's

Age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [54]:
# Si agregamos el parámetro "dropna = False" ya no omitirá los NaN's

df["Age"].value_counts(dropna = False)

Age
NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
24.50      1
0.67       1
0.42       1
34.50      1
74.00      1
Name: count, Length: 89, dtype: int64

In [55]:
# Con .isnull() podemos filtrar el DataFrame para ver las filas con NaN's de una columna

df[df["Age"].isnull()]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000
19,20,"Masselmani, Mrs. Fatima",female,NaN,1,3,2649,7.2250
26,27,"Emir, Mr. Farred Chehab",male,NaN,0,3,2631,7.2250
28,29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,1,3,330959,7.8792
...,...,...,...,...,...,...,...,...
859,860,"Razi, Mr. Raihed",male,NaN,0,3,2629,7.2292
863,864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,0,3,CA. 2343,69.5500
868,869,"van Melkebeke, Mr. Philemon",male,NaN,0,3,345777,9.5000
878,879,"Laleff, Mr. Kristo",male,NaN,0,3,349217,7.8958
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,W./C. 6607,23.4500

In [56]:
# Si queremos ver cuantos NaN's hay por columna podemos usar el método .isna()

df.isna().sum()

PassengerId      0
Name             0
Sex              0
Age            177
Survived         0
Pclass           0
Ticket           0
Fare             0
dtype: int64

In [57]:
# Incluso verlo en porcentaje

df.isna().sum()*100/df.shape[0]

PassengerId     0.00000
Name            0.00000
Sex             0.00000
Age            19.86532
Survived        0.00000
Pclass          0.00000
Ticket          0.00000
Fare            0.00000
dtype: float64

#### Eliminar NaN's

In [58]:
# Para eliminar los NaN's podemos usar .dropna()
# Esta operación no es in-place

df.dropna()

# El número de filas cambia porque se eliminar las filas con al menos un NaN.
# El índice queda igual, no se modifica por haber perdido filas
# Para "actualizar" el índice podemos usar .reset_index()

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500
...,...,...,...,...,...,...,...,...
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,3,382652,29.1250
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000
890,891,"Dooley, Mr. Patrick",male,32.0,0,3,370376,7.7500

#### Rellenar NaN's

In [59]:
# Para llenar los NaN's de una columna podemos usar la función .fillna()
# El elemento para rellenar los NaN's idealmente debe ser del mismo tipo de dato que la columna
# De los contrario pandas transformará todos los elementos al tipo de dato mas general

df["Age"].fillna(999)

# Probar con:
# df["Age"].fillna("999")
# Con esto todos los elementos dejan de ser números a ser strings.

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
       ...
886     27.0
887     19.0
888    999.0
889     26.0
890     32.0
Name: Age, Length: 891, dtype: float64

### GroupBy

El método _**.groupby()**_ permite agrupar filas de un **pd.DataFrame()** en función de una o más columnas y aplicar funciones a cada grupo.

Usaremos en conjunto con el _**.groupby()**_ las funciones de _agregación_ y los métodos _**.aggregate()**_ y _**.agg()**_:

|Función   |
|----------|
|**max**   |
|**min**   |
|**sum**   |
|**mean**  |
|**median**|
|**count** |
|**std**   |

Las funciones de _agregación_ se llaman así porque combinan o resumen varios valores en un solo valor.

En inglés se les llaman _**aggregate functions**_.

In [79]:
# Vamos a usar otro pd.DataFrame()
# Este DataFrame contiene información de migración de paises a Canada

df = pd.read_excel("../Data/Canada.xlsx")

df.head(3)

,Tipo,Pais,Area,Continente,Region,Nombre de region,Tipo de region,1980,1981,1982,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Afghanistan,935,Asia,5501,Southern Asia,Developing regions,16,39,39,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Albania,908,Europe,925,Southern Europe,Developed regions,1,0,0,...,1450,1223,856,702,560,716,561,539,620,603
2,Immigrants,Algeria,903,Africa,912,Northern Africa,Developing regions,80,67,71,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331

In [80]:
df["Continente"].unique()

array(['Asia', 'Europe', 'Africa', 'Oceania',
       'Latin America and the Caribbean', 'Northern America'],
      dtype=object)

In [81]:
# .groupby() se usa para agrupar filas que tienen los mismos valores.
# Obligatoriamente se usa junto con funciones agregadas para producir informes resumidos.

df.groupby(by = "Continente")

# Solo usar .groupby() retorna el objeto de la operación, pero no muestra nada

In [63]:
# Para ejecutar alguna operación o aggregate function podemos hacer simplemente:

df.groupby(by = "Continente").max()

# En este ejemplo usamos la función "max"
# El DataFrame muestra por cada continente el "max" por cada columna

,Tipo,Pais,Area,Region,Nombre de region,Tipo de region,1980,1981,1982,1983,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
Continente,,,,,,,,,,,,,,,,,,,,,
Africa,Immigrants,Zimbabwe,903,914,Western Africa,Developing regions,1026,1118,781,474,...,3686,3626,4807,4021,4226,5532,6242,4663,5555,4331
Asia,Immigrants,Yemen,935,5501,Western Asia,Developing regions,8880,8670,8147,7338,...,36619,42584,33848,28742,30037,29622,38617,36765,34315,34129
Europe,Immigrants,United Kingdom of Great Britain and Northern I...,908,926,Western Europe,Developed regions,22045,24796,20620,10015,...,7533,7258,7140,8216,8979,8876,8724,6204,6280,5827
Latin America and the Caribbean,Immigrants,Venezuela (Bolivarian Republic of),904,931,South America,Developing regions,3198,3692,3575,2860,...,4566,6424,6535,5357,5452,4652,5218,6503,5868,4152
Northern America,Immigrants,United States of America,905,905,Northern America,Developed regions,9378,10030,9074,7100,...,6990,8394,9613,9463,10190,8995,8142,7676,7891,8501
Oceania,Immigrants,Vanuatu,909,957,Polynesia,Developing regions,702,705,814,554,...,930,909,875,1033,1018,1018,933,851,982,1121

In [64]:
# También podemos usar el método .aggregate()

df.groupby(by = "Continente").aggregate(["max"])

# En este ejemplo usamos la función "max"
# El DataFrame muestra por cada continente el "max" por cada columna, también añade otro nivel de columnas
# Es la principal diferencia entre este método y el anterior

,Tipo,Pais,Area,Region,Nombre de region,Tipo de region,1980,1981,1982,1983,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
,max,max,max,max,max,max,max,max,max,max,...,max,max,max,max,max,max,max,max,max,max
Continente,,,,,,,,,,,,,,,,,,,,,
Africa,Immigrants,Zimbabwe,903,914,Western Africa,Developing regions,1026,1118,781,474,...,3686,3626,4807,4021,4226,5532,6242,4663,5555,4331
Asia,Immigrants,Yemen,935,5501,Western Asia,Developing regions,8880,8670,8147,7338,...,36619,42584,33848,28742,30037,29622,38617,36765,34315,34129
Europe,Immigrants,United Kingdom of Great Britain and Northern I...,908,926,Western Europe,Developed regions,22045,24796,20620,10015,...,7533,7258,7140,8216,8979,8876,8724,6204,6280,5827
Latin America and the Caribbean,Immigrants,Venezuela (Bolivarian Republic of),904,931,South America,Developing regions,3198,3692,3575,2860,...,4566,6424,6535,5357,5452,4652,5218,6503,5868,4152
Northern America,Immigrants,United States of America,905,905,Northern America,Developed regions,9378,10030,9074,7100,...,6990,8394,9613,9463,10190,8995,8142,7676,7891,8501
Oceania,Immigrants,Vanuatu,909,957,Polynesia,Developing regions,702,705,814,554,...,930,909,875,1033,1018,1018,933,851,982,1121

In [65]:
# El método .aggregate() permite hacer más de una función a la vez

df.groupby(by = "Continente").aggregate(["min", "max"])

                                       Tipo                             Pais  \
                                        min         max                  min
Continente
Africa                           Immigrants  Immigrants              Algeria
Asia                             Immigrants  Immigrants          Afghanistan
Europe                           Immigrants  Immigrants              Albania
Latin America and the Caribbean  Immigrants  Immigrants  Antigua and Barbuda
Northern America                 Immigrants  Immigrants               Canada
Oceania                          Immigrants  Immigrants       American Samoa

                                                                                    \
                                                                               max
Continente
Africa                                                                    Zimbabwe
Asia                                                                         Yemen
Europe                           United Kingdom of Great Britain and Northern I...
Latin America and the Caribbean                 Venezuela (Bolivarian Republic of)
Northern America                                          United States of America
Oceania                                                                    Vanuatu

                                Area      Region        \
                                 min  max    min   max
Continente
Africa                           903  903    910   914
Asia                             935  935    906  5501
Europe                           908  908    923   926
Latin America and the Caribbean  904  904    915   931
Northern America                 905  905    905   905
Oceania                          909  909    927   957

                                          Nombre de region                    \
                                                       min               max
Continente
Africa                                      Eastern Africa    Western Africa
Asia                                          Central Asia      Western Asia
Europe                                      Eastern Europe    Western Europe
Latin America and the Caribbean                  Caribbean     South America
Northern America                          Northern America  Northern America
Oceania                          Australia and New Zealand         Polynesia

                                 ... 2009        2010        2011        2012  \
                                 ...  min    max  min    max  min    max  min
Continente                       ...
Africa                           ...    0   5532    0   6242    0   4663    0
Asia                             ...    5  29622    4  38617    3  36765    1
Europe                           ...    0   8876    0   8724    0   6204    0
Latin America and the Caribbean  ...   11   4652   13   5218   11   6503   16
Northern America                 ...    0   8995    0   8142    1   7676    1
Oceania                          ...    0   1018    0    933    0    851    0

                                       2013
                                   max  min    max
Continente
Africa                            5555    0   4331
Asia                             34315    1  34129
Europe                            6280    0   5827
Latin America and the Caribbean   5868    4   4152
Northern America                  7891    2   8501
Oceania                            982    0   1121

[6 rows x 80 columns]

In [66]:
# Otra opción puede ser usar el método .agg()
# La diferencia es que este método toma como parámetro un diccionario
# Donde la llave es la columna del DataFrame y el valor una lista de aggregate functions

df.groupby(by = "Continente").agg({2000 : ["min", "max", "sum"],
                                   2001 : ["min", "max"],
                                   2002 : ["count"]})

# La ventaja es que solo aplica las aggregate functions a las columnas indicadas, no a todo el DataFrame

                                2000                2001         2002
                                 min    max     sum  min    max count
Continente
Africa                             0   2867   20346    0   4067    54
Asia                               1  35529  134544    0  36434    49
Europe                             0   8840   38215    0  11728    43
Latin America and the Caribbean   11   2482   16898   11   2965    33
Northern America                   0   5433    5433    0   5604     2
Oceania                            0    599    1276    0    799    14

In [67]:
# También podemos hacer .groupby() a varias columnas a la vez

df.groupby(by = ["Continente", "Tipo de region"]).agg({2000 : ["min", "max", "sum"]})

                                                    2000
                                                     min    max     sum
Continente                      Tipo de region
Africa                          Developing regions     0   2867   20346
Asia                            Developed regions   1010   1010    1010
                                Developing regions     1  35529  133534
Europe                          Developed regions      0   8840   38215
Latin America and the Caribbean Developing regions    11   2482   16898
Northern America                Developed regions      0   5433    5433
Oceania                         Developed regions    212    599     811
                                Developing regions     0    458     465

In [68]:
# También podemos hacer .groupby() a varias columnas a la vez

df.groupby(by = ["Tipo de region", "Continente"]).agg({2000 : ["min", "max", "sum"]})

# En este ejemplo cambiamos el orden de las columnas del .groupby(), el resultado está en otro orden

                                                    2000
                                                     min    max     sum
Tipo de region     Continente
Developed regions  Asia                             1010   1010    1010
                   Europe                              0   8840   38215
                   Northern America                    0   5433    5433
                   Oceania                           212    599     811
Developing regions Africa                              0   2867   20346
                   Asia                                1  35529  133534
                   Latin America and the Caribbean    11   2482   16898
                   Oceania                             0    458     465

In [69]:
# Podemos agregar el parámetro "as_index = False" para que las columnas del .groupby()
# No se conviertan en el índice

df1 = df.groupby(by = ["Tipo de region", "Continente"], as_index = False).agg({2000 : ["min", "max", "sum"]})

df1
# De esta manera podemos seguir usando los elementos de las columnas

       Tipo de region                       Continente  2000
                                                         min    max     sum
0   Developed regions                             Asia  1010   1010    1010
1   Developed regions                           Europe     0   8840   38215
2   Developed regions                 Northern America     0   5433    5433
3   Developed regions                          Oceania   212    599     811
4  Developing regions                           Africa     0   2867   20346
5  Developing regions                             Asia     1  35529  133534
6  Developing regions  Latin America and the Caribbean    11   2482   16898
7  Developing regions                          Oceania     0    458     465

In [70]:
# Debido al doble nivel de columnas, obtenemos este resultado al ver las columnas

df1.columns

# Es una lista de tuplas, donde cada tupla es el nombre de la columna y el aggregate function aplicada a cada una

MultiIndex([('Tipo de region',    ''),
            (    'Continente',    ''),
            (            2000, 'min'),
            (            2000, 'max'),
            (            2000, 'sum')],
           )

In [71]:
# Para eliminar los niveles de las columnas podemos usar el siguiente código

# Guardamos el .groupby() en una variable
df1 = df.groupby(by = ["Tipo de region", "Continente"], as_index = False).agg({2000 : ["min", "max", "sum"]})

df1.columns = [f"{x[0]}_{x[1]}" if x[1] != "" else f"{x[0]}" for x in df1.columns.values]

df1

,Tipo de region,Continente,2000_min,2000_max,2000_sum
0,Developed regions,Asia,1010,1010,1010
1,Developed regions,Europe,0,8840,38215
2,Developed regions,Northern America,0,5433,5433
3,Developed regions,Oceania,212,599,811
4,Developing regions,Africa,0,2867,20346
5,Developing regions,Asia,1,35529,133534
6,Developing regions,Latin America and the Caribbean,11,2482,16898
7,Developing regions,Oceania,0,458,465

In [72]:
################################################################################################################################